historic/buffered/m2.x4large/randread-06-64.fio.out
randread-64k: (g=0): rw=randread, bs=64K-64K/64K-64K/64K-64K, ioengine=libaio, iodepth=10
fio-2.1.4
Starting 1 process

randread-64k: (groupid=0, jobs=1): err= 0: pid=26070: Sat Mar 15 04:22:47 2014
  read : io=1156.7MB, bw=19729KB/s, iops=308, runt= 60003msec
    slat (usec): min=495, max=5460, avg=3229.12, stdev=547.62
    clat (usec): min=5, max=31456, avg=29104.50, stdev=2725.13
     lat (msec): min=2, max=34, avg=32.33, stdev= 3.00
    clat percentiles (usec):
     |  1.00th=[ 5664],  5.00th=[28800], 10.00th=[29056], 20.00th=[29056],
     | 30.00th=[29056], 40.00th=[29056], 50.00th=[29056], 60.00th=[29824],
     | 70.00th=[30080], 80.00th=[30080], 90.00th=[30080], 95.00th=[30080],
     | 99.00th=[30080], 99.50th=[30336], 99.90th=[30848], 99.95th=[31104],
     | 99.99th=[31360]
    bw (KB  /s): min=18432, max=35697, per=99.99%, avg=19726.77, stdev=1486.82
    lat (usec) : 10=0.01%
    lat (msec) : 4=0.01%, 10=1.21%, 20=0.06%, 50=98.71%
  cpu          : usr=0.04%, sys=2.18%, ctx=18535, majf=0, minf=187
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=18497/w=0/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=1156.7MB, aggrb=19729KB/s, minb=19729KB/s, maxb=19729KB/s, mint=60003msec, maxt=60003msec

Disk stats (read/write):
  xvdf: ios=36902/0, merge=0/0, ticks=118791/0, in_queue=118797, util=99.02%